class Solution {
public:
    string baseNeg2(int N) {
        if(N == 0){
            return "0";
        }
        string ans = "\0";
        while(N){                               //采用短除法
            ans += (abs(N % -2) + '0');
            N = (N - abs(N % -2)) / (-2);       //注意,由于对于转换后进制序列必须为正,故在对序列进行处理的时候如-7 / -2 时实际上是余-1的
                                                //但是为了保证余数为正,所以这里必须处理为-8,因为-7 - (-8 [-2*4])是1,所以此处结果N的值应该是4而不是三
                                                //所以-7 -1(值的是余数为-1的情况) / -2 = 4
                                                //当处理7和-2时,余数1,所以对于(7-1)/-2 和 7/-2 结果为3均不影响.
        }
        reverse(ans.begin(),ans.end());
        return ans;
    }
};